app/controllers/admin/posts_controller.rb

INSERT INTO "posts" ("title", "category_id", "tags", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Blog Post One"], ["updated_at", "2016-06-18 17:35:58.069949"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)