app/controllers/admin/users_controller.rb

INSERT INTO "users" ("name", "email", "password_salt", "password_hash", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "name" = ?, "password_salt" = ?, "password_hash" = ?, "updated_at" = ? WHERE "users"."id" = ?
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)