app/views/admin/posts/new.html.erb

    <%= f.label :category %>
    <%= f.select :category_id, Category.all.collect {|x| [x.name, x.id]}, {:include_blank => 'Select One'}, class:'form-control' %>
---
SELECT "categories".* FROM "categories"

    <%= f.label :author %>
    <%= f.select :user_id, User.all.collect {|x| [x.name, x.id]}, {:include_blank => 'Select One'}, class:'form-control' %>
---
SELECT "users".* FROM "users"